Revit 2027 API
BarTerminationsData.EndTreatmentTypeIdAtEnd Property
 Identifies the end treatment type at the end of bar. Setting this property to a valid value, will set the CrankTypeIdAtEnd and HookTypeIdAtEnd to ElementId.InvalidElementId.
Namespace: Autodesk.Revit.DB.Structure
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public ElementId EndTreatmentTypeIdAtEnd { get; set; }
Public Property EndTreatmentTypeIdAtEnd As ElementId
	Get
	Set
public:
property ElementId^ EndTreatmentTypeIdAtEnd {
	ElementId^ get ();
	void set (ElementId^ value);
}
member EndTreatmentTypeIdAtEnd : ElementId with get, set
Property Value
ElementId
Exceptions
Exception | Condition
ArgumentException |  When setting this property: endTreatmentTypeIdAtEnd doesn't represent an end treatment type.
ArgumentNullException |  When setting this property: A non-optional argument was null
See Also
Reference
BarTerminationsData Class
Autodesk.Revit.DB.Structure Namespace